{
    "name": "Devin Liu",
    "about": "I'm a full-stack developer based in Chicago. I like building random useful stuff, whether that be websites, mobile apps, or automation tools. I'm passionate about learning new tech and applying them to projects to solve real-world problems",

    "projects": [
      {
        "title": "Devin's Portfolio",
        "alt": "Personal Portfolio Site",
        "description": "The website you are currently on. It showcases my project, experience, as well as some of my hobbies. This personal site is built and deployed on Vercel using React and Vite.js frontend, styled with Tailwind CSS and the Framer-Motion library.",
        "img_url": null,
        "github_url": "https://www.github.com/liudev777"
      },
      {
        "title": "CareerProMatch",
        "alt": "Ai enhanced job board",
        "description": "Whats better than a regular job board like indeed that gives you sorta relevant jobs? An AI-powered job board that gives you definitely relevant jobs! CareerProMatch delivers tailored job recommendations using React, Java Spring Boot and MySQL and automates job postings with Selenium web scraping. It is (was) deployed on AWS EC2 and RDS. ",
        "img_url": null,
        "github_url": "https://www.github.com/liudev777"
      },
      {
        "title": "Re:Eval Epilepsy",
        "alt": "Epilepsy diagnosis re-evaluation site",
        "description": "Don't you just hate it when your doctor accidentally misdiagnoses you with epilepsy and causes you to lose your drivers license? Re:Eval Epilepsy is a website that integrates a ML model to reduce epilepsy misdiagnosis, achieving 78% classification accuracy for abnormal EEG recordings.",
        "img_url": null,
        "github_url": "https://www.github.com/liudev777" 
      },
      {
        "title": "S2K Mapper",
        "alt": "Kiosk Square® payment mapping tool",
        "description": "Everyone hates tedious tasks, especially me (hence why I became a software engineer). Therefore I made an automation tool during my free time for my software QA internship to streamline the mapping of Square® payment devices to self-checkout kiosks using React Native, Node.js, and Websocket. Instead of manually entering serial numbers and pairing them in the companys slow web tool, I can now take a picture of the serial number and it'll do the job for me!",
        "img_url": null,
        "github_url": "https://www.github.com/liudev777"
      },
      {
        "title": "Discord Job Bot",
        "alt": "SWE job posting Discord bot",
        "description": "Discord Job Bot (very creative name) is a Discord bot that provides real-time SWE job listings based on user preferences such as seniority and location. It uses AWS RDS and BeautifulSoup for efficient data scraping. While we are at it, why not throw in daily LeetCode practices just for fun.",
        "img_url": null,
        "github_url": "https://www.github.com/liudev777"
      },
      {
        "title": "AniBot",
        "alt": "Hackathon Discord anime scheduler bot",
        "description": "During covid, everyone was streaming anime in Discord with their friends. Wouldn't it be nice to have a Bot that reminds you when your favorite show airs? AniBot is (was) deployed on Heroku with OAuth integration for Anilist API to keep all those questionable animes you have been watching secure. It includes real-time notifications for airing shows. Preference data is stored in Supabase SQL database.",
        "img_url": null,
        "github_url": "https://www.github.com/liudev777"
      }
    ],

  "urls": {
    "github": "https://www.github.com/liudev777",
    "linkedin": "https://www.linkedin.com/in/liudev777",
    "instagram": "https://www.instagram.com/d.liuliuliu"
  },
  "experiences": [
    {
      "company": "State Farm",
      "title": "Software Engineer Intern",
      "from": "05/2024",
      "to": "08/2024",
      "description": "Worked in the Property & Casualty Actuarial Underwriting Modeling department (PCM) with team Acadia on the company's internal Query Management System: an abstracted drag and drop web app approach to traditional database querying, using React and Python."
    },
    {
      "company": "INFI",
      "title": "Software Developer Intern",
      "from": "12/2023",
      "to": null,
      "description": "Lead the development of an automation tool to map Kiosks with crash logs to their respective merchant for troubleshooting using Python, Google Cloud, BigQuery API, and Alibaba SLS."
    },
    {
      "company": "INFI",
      "title": "Software QA Intern",
      "from": "05/2023",
      "to": "08/2023",
      "description": "Created manual integration and acceptance tests for Android, IOS, and web apps, documenting over 100 bugs per sprint."
    },
    {
      "company": "INFI",
      "title": "Operations Member",
      "from": "05/2022",
      "to": "08/2022",
      "description": "Designed wiring configurations to compactly install Square Payment devices onto company Kiosks. Performed onsite installation, shipping, and customer service."
    },
    {
      "company": "8A5E",
      "title": "Intern",
      "from": "07/2021",
      "to": "08/2021",
      "description": "Fixed computers, resold business equipments, and made coffee all in one"
    }
  ]
}